isunavi/SOFTWARES/_modules/drivers/halLCD_stm8l.c
#include "halLCD_stm8l.h"
#include "board.h"
//#include "iostm8l152c6.h"
#include "stm8L15x_clk.h"
#include "stm8L15x_gpio.h"

//*******************************************************************************************************************
//массив символов цифр
const unsigned int number_mask[] = 
{
  //0
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //1
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //2
  (1<<A_)|(1<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),  
  //3
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //4
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //5
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //6
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //7
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //8
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //9
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL)
};

//массив символов латинского алфавита
const unsigned int char_mask[] = 
{
  //A
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //B
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //C
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),  
  //D
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //E
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //F
  (1<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //G
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //H
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //I
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //J
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //K
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //L
  (0<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //M
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //N
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),  
  //O
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //P
  (1<<A_)|(1<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Q
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //R
  (1<<A_)|(1<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //S
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //T
  (1<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //U
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),   
  //V
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //W
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //X
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Y
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Z  
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL)
};

//массив символов кириллицы
const unsigned int rus_char_mask[] = 
{
  //A
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Б
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //В
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),  
  //Г
  (1<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Д
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Е
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Ж
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //З
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //И
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Й
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //К
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Л
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //М
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Н
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),  
  //О
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //П
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Р
  (1<<A_)|(1<<B_)|(0<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //С
  (1<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Т
  (1<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //У
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Ф
  (1<<A_)|(1<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),   
  //Х
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Ц
  (0<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Ч
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Ш
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Щ
  (0<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(1<<E_)|(1<<F_)|(0<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //Ъ
  (0<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Ы
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(1<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Ь
  (0<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL), 
  //Э
  (1<<A_)|(1<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL), 
  //Ю  
  (0<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //Я
  (1<<A_)|(1<<B_)|(1<<C_)|(0<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL)
};
//определения спецсимволов
const unsigned int spec_char_mask[] =
{
  //$
  (1<<A_)|(0<<B_)|(1<<C_)|(1<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //(
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //)
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(0<<G_)|(1<<H_)|(0<<J_)|(0<<K_)|(0<<M_)|(0<<N_)|(0<<P_)|(1<<Q_)|(0<<DP)|(0<<COL),
  //*
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(1<<H_)|(1<<J_)|(1<<K_)|(1<<M_)|(1<<N_)|(1<<P_)|(1<<Q_)|(0<<DP)|(0<<COL),
  //+
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(1<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //-
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //=
  (0<<A_)|(0<<B_)|(0<<C_)|(1<<D_)|(0<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //m
  (0<<A_)|(0<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(1<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //u
  (0<<A_)|(0<<B_)|(0<<C_)|(0<<D_)|(0<<E_)|(1<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(1<<K_)|(0<<M_)|(1<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL),
  //n
  (0<<A_)|(0<<B_)|(1<<C_)|(0<<D_)|(1<<E_)|(0<<F_)|(1<<G_)|(0<<H_)|(0<<J_)|(0<<K_)|(1<<M_)|(0<<N_)|(0<<P_)|(0<<Q_)|(0<<DP)|(0<<COL)
};

const uint8_t lcd_ram[] = {0xFF, 0xAF, 0xEB, 0x70, 0x1F, 0x0C};

void LCD_Init(void)
{
 CLK_PeripheralClockConfig(CLK_Peripheral_LCD, ENABLE); //Подаем тактовый сигнал на LCD.
 CLK_PeripheralClockConfig(CLK_Peripheral_RTC, ENABLE); //Подаем такт на RTC
 CLK_RTCClockConfig(CLK_RTCCLKSource_LSI, CLK_RTCCLKDiv_1); //Убираем прескллер
//Подаем тактирование на LCD, RTC:
 //CLK->PCKENR2 |= (1<<3)|(1<<2);
//Выбираем внешний кварц (LSE) для RTC:
//CLK_CRTCR_bit.RTCSEL3 = 1;
 //CLK_CRTCR_bit.RTCSEL2 = 0;
 //CLK_CRTCR_bit.RTCSEL1 = 0;
 //CLK_CRTCR_bit.RTCSEL0 = 0;
//Ожидание стабилизации внешнего кварца:
//while(CLK_ECKR_bit.LSERDY==0);
 
 LCD->CR1 = (3<<1) + (5<<3); //Duty = 1/4, Blink Freq = LCDclk/256
 LCD->CR2 = (6<<1) | LCD_CR2_HD; //Контрастность = 6 (из 7), низкоомный драйвер.
 LCD->FRQ = (2<<4); //LCDclk = 32768/2/(2^1*16) = 512Hz
 
 
  //Задействованы все сегменты:
 LCD->PM[0] = 0xFF; 
 LCD->PM[1] = 0xFF;
 LCD->PM[2] = 0xFF;
 LCD->CR3 |= LCD_CR3_LCDEN | 2; //ВКЛ и deadtime = 2 
 
/*.............Настройка LCD.............*/
//устанавливаем скважность:
 //LCD_CR1_bit.DUTY1 = 1;/****фактически ****/
 //LCD_CR1_bit.DUTY0 = 1;/*количество COM-ов*/
 
 //LCD_CR2_bit.PON0 = 1;
 //LCD_CR2_bit.PON1 = 1;
 //LCD_CR2_bit.PON2 = 1;
 
//прескаллер n = 2 (коэфициэнт деления будет 2^n, F=(F_RTC/2)/2^n)
 //LCD_FRQ_bit.PS3 = 0;/****После прескаллера (32768/2)/4=4096****/
 //LCD_FRQ_bit.PS2 = 0;/**и дальше проходит через делитель на 16**/
 //LCD_FRQ_bit.PS1 = 1;/******что и даст в результате 256 Гц******/
 //LCD_FRQ_bit.PS0 = 0;/******частота кадра же равна 256/4 Гц*****/
//включение LCD:
 //LCD_CR3_bit.LCDEN=1;
   
