isunavi/SOFTWARES/_modules/drivers/halLCD_stm8l.c
//включим 24 ноги для управления сегментами (SEG00 -- SEG23):
   LCD->PM[0] = (1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7);
   LCD->PM[1] = (1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7);
   LCD->PM[2] = (1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7);
   
    //Перегоняем массив в LCD RAM
// for (counter=0; counter<6; counter++) LCD->RAM[counter] = lcd_ram[counter]; 
 
}
//*******************************************************************************************************************

void LCD_Contrast(unsigned char cntr)
{
//установка контрасности:
    LCD->CR2 |= ((cntr&0x07)<<1);
}
//*******************************************************************************************************************

static unsigned int LCD_Char_Find(unsigned char* symb)
{
  unsigned int cur_char;
//если цифра:
      if ( (*symb <= 0x39) && (*symb >= 0x30) )
      {
        cur_char = number_mask[*symb-'0'];
      }
//если буква латинского алфавита:
      /* Если символ введён в верхнем регистре*/
      else{if ((*symb <= 0x5A) && (*symb >= 0x41))
      {
        cur_char = char_mask[*symb-'A'];
      }
      /* Если символ введён в нижнем регистре*/
      else{if ((*symb <= 0x7A) && ( *symb >= 0x61))    
      {
        cur_char = char_mask[*symb-'a'];
      }
//если буква кириллицы:
      /* Если символ введён в верхнем регистре*/
      else{if ((*symb <= 0xDF) && ( *symb >= 0xC0))
      {
        cur_char = rus_char_mask[*symb-'А'];
      }
      /* Если символ введён в нижнем регистре*/
      else{if (*symb >= 0xE0)
      {
        cur_char = rus_char_mask[*symb-'а'];
      }
      else
      {
        switch (*symb)
        {
//если спецсимвол:            
          case '$':
            cur_char = spec_char_mask[0];
            break;
            
          case '(':
            cur_char = spec_char_mask[1];
            break;
            
          case ')':
            cur_char = spec_char_mask[2];
            break;
            
          case '*':
            cur_char = spec_char_mask[3];
            break;
            
          case '+':
            cur_char = spec_char_mask[4];
            break;
            
          case '-':
            cur_char = spec_char_mask[5];
            break;
            
          case '=':
            cur_char = spec_char_mask[6];
            break;
            
          default:
            cur_char = 0x00;
            break;
        };
      };
      };
      };
      };
      };
      
      if(*symb=='m') {cur_char = spec_char_mask[7];}
      if(*symb=='u') {cur_char = spec_char_mask[8];}
      if(*symb=='n') {cur_char = spec_char_mask[9];}
      
  return(cur_char);
}
//*******************************************************************************************************************

void LCD_Write_Char(unsigned char* ch, bool point, bool column, unsigned char position)
{
  unsigned int cur_char; /*контейнер для хранения маски символа*/
  unsigned char temp[2];
  
/* Определение соответствующей символу константы*/
  cur_char = LCD_Char_Find(ch);
  if(position<5)/* В пятом, шестом знакоместе BAR */
  {
    /* Установка состояния десятичной точки */
    if(point){cur_char |= (1<<DP);};
    /* Установка состояния двоеточия */
    if(column){cur_char |= (1<<COL);};
  };

temp[0]=(unsigned char)cur_char;
temp[1]=(unsigned char)(cur_char>>8);

/*Запись маски символа в биты LCD_RAM, соответствующие текущей позиции*/
switch (position)
  {
    /* Позиция 1 */
    case 1:
      /*Очистка 1M, 1E*/            /*Запись нового значения 1M, 1E*/
      LCD->RAM[0] &= ~((1<<1)|(1<<0)); LCD->RAM[0] |= temp[0] & ((1<<1)|(1<<0));
      /*Очистка 1G, 1B*/            /*Запись нового значения 1G, 1B*/
      LCD->RAM[2] &= ~((1<<7)|(1<<6)); LCD->RAM[2] |= (temp[0]<<4) & ((1<<7)|(1<<6));
      /*Очистка 1C, 1D*/            /*Запись нового значения 1C, 1D*/
      LCD->RAM[3] &= ~((1<<5)|(1<<4)); LCD->RAM[3] |= temp[0] & ((1<<5)|(1<<4));
      /*Очистка 1F, 1A*/            /*Запись нового значения 1F, 1A*/
      LCD->RAM[6] &= ~((1<<3)|(1<<2)); LCD->RAM[6] |= (temp[0]>>4) & ((1<<3)|(1<<2));
      /*Очистка 1COL, 1P*/          /*Запись нового значения 1COL, 1P*/
      LCD->RAM[7] &= ~((1<<1)|(1<<0)); LCD->RAM[7] |= temp[1] & ((1<<1)|(1<<0));
      /*Очистка 1Q, 1K*/            /*Запись нового значения 1Q, 1K*/
      LCD->RAM[9] &= ~((1<<7)|(1<<6)); LCD->RAM[9] |= (temp[1]<<4) & ((1<<7)|(1<<6));
      /*Очистка 1DP, 1N*/           /*Запись нового значения 1DP, 1N*/
      LCD->RAM[10] &= ~((1<<5)|(1<<4)); LCD->RAM[10] |= temp[1] & ((1<<5)|(1<<4));
      /*Очистка 1H, 1J*/            /*Запись нового значения 1H, 1J*/
      LCD->RAM[13] &= ~((1<<3)|(1<<2)); LCD->RAM[13] |= (temp[1]>>4) & ((1<<3)|(1<<2));
      break;
    
    /* Позиция 2 */
    case 2:
      /*Очистка 2M, 2E*/            /*Запись нового значения 2M, 2E*/
      LCD->RAM[0] &= ~((1<<3)|(1<<2)); LCD->RAM[0] |= (temp[0]<<2) & ((1<<3)|(1<<2));
      /*Очистка 2G, 2B*/            /*Запись нового значения 2G, 2B*/
      LCD->RAM[2] &= ~((1<<5)|(1<<4)); LCD->RAM[2] |= (temp[0]<<2) & ((1<<5)|(1<<4));
      /*Очистка 2C, 2D*/            /*Запись нового значения 2C, 2D*/
      LCD->RAM[3] &= ~((1<<7)|(1<<6)); LCD->RAM[3] |= (temp[0]<<2) & ((1<<7)|(1<<6));
      /*Очистка 2F, 2A*/            /*Запись нового значения 2F, 2A*/
      LCD->RAM[6] &= ~((1<<1)|(1<<0)); LCD->RAM[6] |= (temp[0]>>6) & ((1<<1)|(1<<0));
      /*Очистка 2COL, 2P*/          /*Запись нового значения 2COL, 2P*/
      LCD->RAM[7] &= ~((1<<3)|(1<<2)); LCD->RAM[7] |= (temp[1]<<2) & ((1<<3)|(1<<2));
      /*Очистка 2Q, 2K*/            /*Запись нового значения 2Q, 2K*/
      LCD->RAM[9] &= ~((1<<5)|(1<<4)); LCD->RAM[9] |= (temp[1]<<2) & ((1<<5)|(1<<4));
      /*Очистка 2DP, 2N*/           /*Запись нового значения 2DP, 2N*/
      LCD->RAM[10] &= ~((1<<7)|(1<<6)); LCD->RAM[10] |= (temp[1]<<2) & ((1<<7)|(1<<6));
      /*Очистка 2H, 2J*/            /*Запись нового значения 2H, 2J*/
      LCD->RAM[13] &= ~((1<<1)|(1<<0)); LCD->RAM[13] |= (temp[1]>>6) & ((1<<1)|(1<<0));
      break;
    
    /* Позиция 3 */
    case 3:
      /*Очистка 3M, 3E*/            /*Запись нового значения 3M, 3E*/
      LCD->RAM[0] &= ~((1<<5)|(1<<4)); LCD->RAM[0] |= (temp[0]<<4) & ((1<<5)|(1<<4));
      /*Очистка 3G, 3B*/            /*Запись нового значения 3G, 3B*/
      LCD->RAM[2] &= ~((1<<3)|(1<<2)); LCD->RAM[2] |= temp[0] & ((1<<3)|(1<<2));
      /*Очистка 3C, 3D*/            /*Запись нового значения 3C, 3D*/
      LCD->RAM[4] &= ~((1<<1)|(1<<0)); LCD->RAM[4] |= (temp[0]>>4) & ((1<<1)|(1<<0));
      /*Очистка 3F, 3A*/            /*Запись нового значения 3F, 3A*/
      LCD->RAM[5] &= ~((1<<7)|(1<<6)); LCD->RAM[5] |= temp[0] & ((1<<7)|(1<<6));
      /*Очистка 3COL, 3P*/          /*Запись нового значения 3COL, 3P*/
      LCD->RAM[7] &= ~((1<<5)|(1<<4)); LCD->RAM[7] |= (temp[1]<<4) & ((1<<5)|(1<<4));
      /*Очистка 3Q, 3K*/            /*Запись нового значения 3Q, 3K*/
      LCD->RAM[9] &= ~((1<<3)|(1<<2)); LCD->RAM[9] |= temp[1] & ((1<<3)|(1<<2));
      /*Очистка 3DP, 3N*/           /*Запись нового значения 3DP, 3N*/
      LCD->RAM[11] &= ~((1<<1)|(1<<0)); LCD->RAM[11] |= (temp[1]>>4) & ((1<<1)|(1<<0));
      /*Очистка 3H, 3J*/            /*Запись нового значения 3H, 3J*/
      LCD->RAM[12] &= ~((1<<7)|(1<<6)); LCD->RAM[12] |= temp[1] & ((1<<7)|(1<<6));
      break;
    
    /* Позиция 4 */
    case 4:
      /*Очистка 4M, 4E*/            /*Запись нового значения 4M, 4E*/
      LCD->RAM[0] &= ~((1<<7)|(1<<6)); LCD->RAM[0] |= (temp[0]<<6) & ((1<<7)|(1<<6));
      /*Очистка 4G, 4B*/            /*Запись нового значения 4G, 4B*/
      LCD->RAM[2] &= ~((1<<1)|(1<<0)); LCD->RAM[2] |= (temp[0]>>2) & ((1<<1)|(1<<0));
      /*Очистка 4C, 4D*/            /*Запись нового значения 4C, 4D*/
      LCD->RAM[4] &= ~((1<<3)|(1<<2)); LCD->RAM[4] |= (temp[0]>>2) & ((1<<3)|(1<<2));
      /*Очистка 4F, 4A*/            /*Запись нового значения 4F, 4A*/
      LCD->RAM[5] &= ~((1<<5)|(1<<4)); LCD->RAM[5] |= (temp[0]>>2) & ((1<<5)|(1<<4));
      /*Очистка 4COL, 4P*/          /*Запись нового значения 4COL, 4P*/
      LCD->RAM[7] &= ~((1<<7)|(1<<6)); LCD->RAM[7] |= (temp[1]<<6) & ((1<<7)|(1<<6));
      /*Очистка 4Q, 4K*/            /*Запись нового значения 4Q, 4K*/
      LCD->RAM[9] &= ~((1<<1)|(1<<0)); LCD->RAM[9] |= (temp[1]>>2) & ((1<<1)|(1<<0));
      /*Очистка 4DP, 4N*/           /*Запись нового значения 4DP, 4N*/
      LCD->RAM[11] &= ~((1<<3)|(1<<2)); LCD->RAM[11] |= (temp[1]>>2) & ((1<<3)|(1<<2));
      /*Очистка 4H, 4J*/            /*Запись нового значения 4H, 4J*/
      LCD->RAM[12] &= ~((1<<5)|(1<<4)); LCD->RAM[12] |= (temp[1]>>2) & ((1<<5)|(1<<4));
      break;
    
    /* позиция 5 */
    case 5:
      /*Очистка 5M, 5E*/            /*Запись нового значения 5M, 5E*/
      LCD->RAM[1] &= ~((1<<1)|(1<<0)); LCD->RAM[1] |= temp[0] & ((1<<1)|(1<<0));
      /*Очистка 5G, 5B*/            /*Запись нового значения 5G, 5B*/
      LCD->RAM[1] &= ~((1<<7)|(1<<6)); LCD->RAM[1] |= (temp[0]<<4) & ((1<<7)|(1<<6));
      /*Очистка 5C, 5D*/            /*Запись нового значения 5C, 5D*/
      LCD->RAM[4] &= ~((1<<5)|(1<<4)); LCD->RAM[4] |= temp[0] & ((1<<5)|(1<<4));
      /*Очистка 5F, 5A*/            /*Запись нового значения 5F, 5A*/
      LCD->RAM[5] &= ~((1<<3)|(1<<2)); LCD->RAM[5] |= (temp[0]>>4) & ((1<<3)|(1<<2));
      /*Очистка 5COL, 5P*/          /*Запись нового значения 5COL, 5P*/
      LCD->RAM[8] &= ~((1<<1)|(1<<0)); LCD->RAM[8] |= temp[1] & ((1<<1)|(1<<0));
      /*Очистка 5Q, 5K*/            /*Запись нового значения 5Q, 5K*/
      LCD->RAM[8] &= ~((1<<7)|(1<<6)); LCD->RAM[8] |= (temp[1]<<4) & ((1<<7)|(1<<6));
      /*Очистка 5DP, 5N*/           /*Запись нового значения 5DP, 5N*/
      LCD->RAM[11] &= ~((1<<5)|(1<<4)); LCD->RAM[11] |= temp[1] & ((1<<5)|(1<<4));
      /*Очистка 5H, 5J*/            /*Запись нового значения 5H, 5J*/
      LCD->RAM[12] &= ~((1<<3)|(1<<2)); LCD->RAM[12] |= (temp[1]>>4) & ((1<<3)|(1<<2));
      break;
    
