isunavi/SOFTWARES/_modules/drivers/halLCD_stm8l.c
    /* Позиция 6 */
    case 6:
      /*Очистка 6M, 6E*/            /*Запись нового значения 6M, 6E*/
      LCD->RAM[1] &= ~((1<<3)|(1<<2)); LCD->RAM[1] |= (temp[0]<<2) & ((1<<3)|(1<<2));
      /*Очистка 6G, 6B*/            /*Запись нового значения 6G, 6B*/
      LCD->RAM[1] &= ~((1<<5)|(1<<4)); LCD->RAM[1] |= (temp[0]<<2) & ((1<<5)|(1<<4));
      /*Очистка 6C, 6D*/            /*Запись нового значения 6C, 6D*/
      LCD->RAM[4] &= ~((1<<7)|(1<<6)); LCD->RAM[4] |= (temp[0]<<2) & ((1<<7)|(1<<6));
      /*Очистка 6F, 6A*/            /*Запись нового значения 6F, 6A*/
      LCD->RAM[5] &= ~((1<<1)|(1<<0)); LCD->RAM[5] |= (temp[0]>>6) & ((1<<1)|(1<<0));
      /*Очистка 6COL, 6P*/          /*Запись нового значения 6COL, 6P*/
      LCD->RAM[8] &= ~((1<<3)|(1<<2)); LCD->RAM[8] |= (temp[1]<<2) & ((1<<3)|(1<<2));
      /*Очистка 6Q, 6K*/            /*Запись нового значения 6Q, 6K*/
      LCD->RAM[8] &= ~((1<<5)|(1<<4)); LCD->RAM[8] |= (temp[1]<<2) & ((1<<5)|(1<<4));
      /*Очистка 6DP, 6N*/           /*Запись нового значения 6DP, 6N*/
      LCD->RAM[11] &= ~((1<<7)|(1<<6)); LCD->RAM[11] |= (temp[1]<<2) & ((1<<7)|(1<<6));
      /*Очистка 6H, 6J*/            /*Запись нового значения 6H, 6J*/
      LCD->RAM[12] &= ~((1<<1)|(1<<0)); LCD->RAM[12] |= (temp[1]>>6) & ((1<<1)|(1<<0));
      break;
    /* выходим во всех остальных случаях (некорректный номер позиции)*/
      default:
      break;
  }
}
//*******************************************************************************************************************

void LCD_Write_String(unsigned char *str)
{
  unsigned char i = 1;

  /* Пока не дошли до конца строки
     или не вывели 6 символов*/
  while ((*str != 0) && (i < 7))
  {
    /* Выводим символ в текущее знакоместо */
    LCD_Write_Char(str, 0, 0, i);

    if(*str == '.')
    {
      i--;
      LCD_Write_Char(str-1, 1, 0, i);
    };
    if(*str == ':')
    {
      i--;
      LCD_Write_Char(str-1, 0, 1, i);
    };
    
    /* перевод указателя на след. символ */
    str++;

    /* Инкремент номера знакоместа */
    i++;
  };
}
